snlkuharlocal/src/DataProcessors/ПоискИнформацииПоКМ/ПоискИнформацииПоКМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ПоискИнформацииПоКМ</name>
</mdclass:DataProcessor>

snlkuharlocal/src/InformationRegisters/СтатусыКМ_Факт/СтатусыКМ_Факт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыКМ_Факт</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыКодовМаркировкиФакт</types>
    </type>
  </resources>
  <resources>
    <name>Местонахождение</name>
    <type>
      <types>CatalogRef.Склады</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>CatalogRef.Подразделения</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>ВПути</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипШК</name>
    <type>
      <types>EnumRef.ТипыШтрихКодов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ШтрихКодУпаковки</name>
    <type>
      <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/DataProcessors/ПоискИнформацииПоКМ/ManagerModule.bsl
Функция НайтиШКПоКМНаименование( Знач КМ) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ШтрихкодыУпаковокТоваров.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
	|ГДЕ
	|	НЕ ШтрихкодыУпаковокТоваров.ПометкаУдаления
	|	И ШтрихкодыУпаковокТоваров.Наименование ПОДОБНО &Наименование";
	
	Запрос.УстановитьПараметр("Наименование", СокрЛП(КМ));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.ссылка; 
	КонецЕсли; 	
	Возврат Справочники.ШтрихкодыУпаковокТоваров.ПустаяСсылка();

КонецФункции // ()

Функция ДанныеПоСтатусамФакт(Знач ШК) Экспорт 

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтатусыКМ_ФактСрезПоследних.Статус КАК Статус,
	|	СтатусыКМ_ФактСрезПоследних.Местонахождение КАК Местонахождение
	|ИЗ
	|	РегистрСведений.СтатусыКМ_Факт.СрезПоследних(, ШтрихКодУпаковки = &ШК) КАК СтатусыКМ_ФактСрезПоследних";
	
	Запрос.УстановитьПараметр("ШК", ШК);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		
		Возврат   Новый Структура("Статус,Местонахождение",ВыборкаДетальныеЗаписи.Статус,ВыборкаДетальныеЗаписи.Местонахождение); 
		
	КонецЕсли;
	
	Возврат Новый Структура("Статус,Местонахождение",Перечисления.СтатусыКодовМаркировкиФакт.ПустаяСсылка(),неопределено);

КонецФункции // ()
